Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotCopyLockedWarn Property
 Can't copy pinned element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCopyLockedWarn { get; }
Public Shared ReadOnly Property CannotCopyLockedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCopyLockedWarn {
	FailureDefinitionId^ get ();
}
static member CannotCopyLockedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace